{
  "response": {
    "status": "ok",
    "userTier": "developer",
    "total": 5,
    "startIndex": 1,
    "pageSize": 10,
    "currentPage": 1,
    "pages": 1,
    "orderBy": "newest",
    "results": [
      {
        "id": "technology/2025/sep/17/google-deepmind-claims-historic-ai-breakthrough-in-problem-solving",
        "type": "article",
        "sectionId": "technology",
        "sectionName": "Technology",
        "webPublicationDate": "2025-09-17T17:42:29Z",
        "webTitle": "Google DeepMind claims ‘historic’ AI breakthrough in problem solving",
        "webUrl": "https://www.theguardian.com/technology/2025/sep/17/google-deepmind-claims-historic-ai-breakthrough-in-problem-solving",
        "apiUrl": "https://content.guardianapis.com/technology/2025/sep/17/google-deepmind-claims-historic-ai-breakthrough-in-problem-solving",
        "fields": {
          "headline": "Google DeepMind claims ‘historic’ AI breakthrough in problem solving",
          "trailText": "Version of company’s Gemini 2.5 AI model solved complex real-world problem that stumped human programmers",
          "byline": "Robert Booth UK technology editor",
          "publication": "The Guardian",
          "shortUrl": "https://www.theguardian.com/p/x38jnv",
          "thumbnail": "https://media.guim.co.uk/48c2f1158b35ff75cb2edcbb613c747af1215f74/33_0_3333_2666/500.jpg",
          "bodyText": "Google DeepMind claims it has made a “historic” artificial intelligence breakthrough akin to the Deep Blue computer defeating Garry Kasparov at chess in 1997 and an AI beating a human Go champion in 2016. A version of the company’s Gemini 2.5 AI model solved a complex real-world problem that stumped human computer programmers to become the first AI model to win a gold medal at an international programming competition held earlier this month in Azerbaijan. In a performance that the tech company called a “profound leap in abstract problem-solving”, it took less than half an hour to work out how to weigh up an infinite number of possibilities in order to send a liquid through a network of ducts to a set of interconnected reservoirs. The goal was to distribute it as quickly as possible. None of the human teams, including the top performers from universities in Russia, China and Japan, got it right. The AI failed two of the 12 tasks it was set, but its overall performance ranked it in second place out of 139 of the world’s strongest college-level computer programmers. Google said it was a “historic moment, towards AGI [artificial general intelligence]”, which is widely considered human-level intelligence at a wide range of tasks. “For me it’s a moment that is equivalent to Deep Blue for Chess and AlphaGo for Go,” said Quoc Le, Google DeepMind’s vice-president. “Even bigger, it is reasoning more towards the real world, not just a constrained environment [like Chess and Go] … because of that I think this advance has the potential to transform many scientific and engineering disciplines.” He cited drug and chip design. The model is a general purpose AI but was specially trained to solve very hard coding, maths and reasoning problems. It performed “as well as a top 20 coder in the world”, Google said. “Solving complex tasks at these competitions requires deep abstract reasoning, creativity, the ability to synthesise novel solutions to problems never seen before and a genuine spark of ingenuity,” the company said. Speaking before the details were made public, Stuart Russell, a professor of computer science at the University of California at Berkeley, said the “claims of epochal significance seem overblown”. He said AI systems had been doing well on programming tasks for a while and the Deep Blue chess breakthrough had “essentially no impact on the real world of applied AI”. However, he said “to get an ICPC [International Collegiate Programming Contest] question right, the code actually has to work correctly (at least on a finite number of test cases), so this performance may show progress towards making AI-based coding systems sufficiently accurate for producing high-quality code”. He added: “The pressure on AI companies to keep claiming breakthroughs is enormous.” Michael Wooldridge, Ashall professor of the foundations of artificial intelligence at the University of Oxford, said it sounded like an impressive achievement and “being able to solve problems at this level is exciting”. But he questioned how much computing power was needed. Google declined to say, apart from confirming it was more than available to an average subscriber to its $250-a-month Google AI Ultra service using the lightweight version of Gemini 2.5 Deep Think in the Gemini App. Dr Bill Poucher, executive director of the ICPC, said: “Gemini successfully joining this arena, and achieving gold-level results, marks a key moment in defining the AI tools and academic standards needed for the next generation.” Four machine intelligence breakthroughs 1957 The Perceptron Frank Rosenblatt, an academic at Cornell University, worked out that it should be possible to create a “perceiving and recognising automaton”. He named it the Perceptron and said an electronic system would be able to learn to recognise patterns in optical, electrical or tonal information “in a manner which may be closely analogous to the perceptual process of a biological brain”. The following year he built the device, which was the size of a small room. It was considered one of the early breakthroughs in artificial intelligence based on neural networks. 1997 Big Blue In May 1997, IBM’s Big Blue became the first computer system to defeat a reigning world chess champion in a match under standard tournament controls. It beat Garry Kasparov in what became an inflection point in computing power, but the contest was close. Kasparov won the first game, Deep Blue the second followed by three draws. Deep Blue won game 6 to secure the win. It showed how brute force computing power could create a system to defeat a human, albeit at a narrow task. “The computer is far stronger than anybody expected,” said Kasparov, conceding defeat. 2016 AlphaGo Go is one of the most complex games ever devised, and one of the world’s master players was Lee Sedol, a South Korean professional. In 2016, DeepMind, the UK AI company set up by Demis Hassabis, took him on with its computer AlphaGo. It won 4-1 and some of its moves seemed to display truly original thinking. Move 37 in particular went down in lore. Hassabis said: “It might be the first glimpse of a bright and bold future where humanity harnesses AI as a powerful new tool, helping us discover new knowledge that can solve some of our most pressing scientific problems.” 2020 AlphaFold Another breakthrough by Hassabis and DeepMind was an AI program that can predict how proteins fold into 3D shapes, a highly complex process fundamental to understanding life’s biological machinery. The Royal Society, the 360-year old London scientific institution, called it “a stunning advance”. When researchers know how a protein folds up, they can start to uncover mysteries such as how insulin controls sugar levels in the blood or how antibodies fight viruses. After further iterations, the system helped Hassabis and his colleague John Jumper share a Nobel prize for chemistry in 2024."
        },
        "isHosted": false,
        "pillarId": "pillar/news",
        "pillarName": "News"
      },
      {
        "id": "technology/2025/sep/17/what-is-new-uk-us-tech-deal-ai-supercomputers-investment-economy",
        "type": "article",
        "sectionId": "technology",
        "sectionName": "Technology",
        "webPublicationDate": "2025-09-17T14:29:18Z",
        "webTitle": "What is new in UK-US tech deal and what will it mean for the British economy?",
        "webUrl": "https://www.theguardian.com/technology/2025/sep/17/what-is-new-uk-us-tech-deal-ai-supercomputers-investment-economy",
        "apiUrl": "https://content.guardianapis.com/technology/2025/sep/17/what-is-new-uk-us-tech-deal-ai-supercomputers-investment-economy",
        "fields": {
          "headline": "What is new in UK-US tech deal and what will it mean for the British economy?",
          "trailText": "Nvidia, OpenAI and Microsoft announce investments as part of multibillion-dollar package alongside Trump visit",
          "byline": "Dan Milmo, Robert Booth and Jillian Ambrose",
          "publication": "The Guardian",
          "shortUrl": "https://www.theguardian.com/p/x38hyc",
          "thumbnail": "https://media.guim.co.uk/de480a6a5dd62313de113f77399f46e9208b8c16/2791_939_5367_4294/500.jpg",
          "bodyText": "Donald Trump’s arrival in the UK on Tuesday night was accompanied by a multibillion-dollar transatlantic tech agreement. The announcement features some of the biggest names from Silicon Valley: the chipmaker Nvidia; the ChatGPT developer, OpenAI; and Microsoft. Big numbers were involved, with Microsoft hailing its $30bn (£22bn) investment as a major commitment to the UK – and adding, in an apparent swipe at its rivals, that it was not making “empty tech promises”. Here is a breakdown of the announcements in the UK-US “tech prosperity deal”, spelling out what is explicitly new in them. Microsoft invests $30bn in UK Microsoft’s president, Brad Smith, hailed the “single biggest announcement” in the pact and insisted it was not an empty promise. The $30bn (£22bn) sets out the company’s UK budget over the next four years and refers not just to artificial intelligence infrastructure but also “ongoing operations” across the UK. Microsoft said the number included $15bn in capital expenditure – such as on equipment, land and buildings – for AI and cloud services, areas where datacentres are key components. The other half will go on day-to-day operations such as research, sales and product development. As part of the package, the US company said it would back an already announced project, an AI datacentre in Loughton, Essex, by becoming a core customer of its owner, the UK-based AI infrastructure company Nscale. Smith had criticised the UK in 2023 as being “bad for business” after Microsoft’s takeover of the video games maker Activision was blocked – a move that was later unwound. He told reporters on Tuesday that Microsoft had been “encouraged” by steps taken by the governments of Rishi Sunak and Keir Starmer, with the latter helping on planning permission and energy access. “We have a more stable opportunity to accelerate investment in the UK,” Smith said. The £22bn is a significant chunk of the £31bn value the UK government placed on the pact, which also includes £5bn of expenditure from Google that the search company described as “additional investment over the next two years”. The Google figure includes capital expenditure, research and development, and related engineering, as well as work at the AI unit Google DeepMind. AI growth zone in north-east England The north-east will host an AI “growth zone”, an area that will receive special support in planning permission and energy provision for hosting AI infrastructure such as datacentres. The government said this could unlock more than 5,000 jobs and bring in £30bn in investment, although this is all hypothetical for now. One of the datacentre sites, Blyth in Northumberland, has already been announced and is receiving £10bn in financial commitment from the US investment firm Blackstone. The other site mentioned, at Cobalt Park in North Tyneside, features a new development: a domestic version of the US “Stargate” datacentre project championed by Trump. Nscale, OpenAI and Nvidia will develop a platform that will deploy OpenAI’s technology in the UK. The idea is that Stargate UK will help develop “sovereign” AI, where cutting-edge technology is developed and used in the UK’s interests. As part of the first phase of Stargate UK, OpenAI will use 8,000 Nvidia graphics processing units (GPUs), the powerful computer chips that underpin AI tools such as ChatGPT. Cobalt Park will be one of several UK sites under the plan. Nvidia’s £11bn announcement Nvidia, the world’s biggest AI chipmaker, touted an £11bn injection into the UK economy as part of the pact, providing up to 120,000 of its powerful Blackwell GPUs to projects that will be built over the next couple of years in the UK. So, there is a degree of overlap with other announcements in the pact. Clarifying its investment on Wednesday, Nvidia said the £11bn referred to the total “end-to-end value” its partners were delivering, encompassing the chips they have bought from Nvidia, land and buildings involved in constructing the datacentres, and supercomputers that will house the GPUs. Nvidia, at $4tn the biggest company in the world’s biggest economy, is also investing £500m in Nscale. Other announcements CoreWeave, a US datacentre company, said it would invest a further £1.5bn in the UK including a site in North Lanarkshire, Scotland. The US software company Salesforce is investing an additional $2bn in the UK, adding two years to a financial commitment to the UK that will now run to 2030. Nvidia will also invest an undisclosed amount in the UK’s AI startup scene. Tech-boss influx The pact, and Trump’s visit, is being accompanied by an entourage of US tech bosses, with the chief executives of Nvidia, Microsoft and OpenAI travelling across the Atlantic to symbolically reinforce their ties to the US president. Since Trump has been in power, US tech leaders have lined up to express loyalty and support for him and this is another opportunity to do so – as well as to support the projection of US leadership in AI. Tim Cook, the chief executive of Apple, is also reportedly attending Wednesday’s state banquet. AI and energy The government claims that the US-UK agreement will “turbocharge” the UK’s low-carbon economy by encouraging the build-out of new nuclear power stations to power the datacentres and supercomputers that underpin the technology. Specifically, the tech pact is expected to bring forward multibillion-pound investments in new nuclear technologies, which would create thousands of jobs under a string of separate transatlantic agreements revealed earlier this week. These new pledges build on Starmer’s existing plan for a once-in-a-generation nuclear expansion that he revealed earlier this year alongside an open invitation to tech companies such as Google, Meta and Amazon to invest in AI datacentres in Britain, which could be powered by small modular reactors. Growing the UK’s low-carbon energy supplies is considered essential if it hopes to host the energy-hungry datacentres required for an AI industry while staying within its net zero carbon budgets. But it will need to add enough new low-carbon energy generation to match the needs of the datacentres, as well as the growing demand for electricity from the rest of the economy, if it hopes to avoid adding extra gas power to the energy system in the future. Many global tech companies, which are also under pressure to satisfy their own carbon-cutting commitments, are turning to nuclear power because reactors generate electricity at a steady rate, which mirrors the energy use of a datacentre. This summer, Meta signed a 20-year deal with a nuclear power station in Illinois, while Amazon and Google are also investing in nuclear energy in the race for AI dominance. Still, the latest AI plans are likely to raise further questions over the UK’s under-pressure water supplies – which are needed to cool down some energy-intensive datacentres."
        },
        "isHosted": false,
        "pillarId": "pillar/news",
        "pillarName": "News"
      },
      {
        "id": "technology/2025/sep/17/jensen-huang-nvidia-uk-ai-superpower-500m-nscale",
        "type": "article",
        "sectionId": "technology",
        "sectionName": "Technology",
        "webPublicationDate": "2025-09-17T13:04:14Z",
        "webTitle": "UK is going to be ‘AI superpower’, says Nvidia boss as he invests £500m",
        "webUrl": "https://www.theguardian.com/technology/2025/sep/17/jensen-huang-nvidia-uk-ai-superpower-500m-nscale",
        "apiUrl": "https://content.guardianapis.com/technology/2025/sep/17/jensen-huang-nvidia-uk-ai-superpower-500m-nscale",
        "fields": {
          "headline": "UK is going to be ‘AI superpower’, says Nvidia boss as he invests £500m",
          "trailText": "Jensen Huang says UK is ‘too humble’ as he announces equity stake in British cloud computing firm NScale",
          "byline": "Robert Booth UK technology editor",
          "publication": "theguardian.com",
          "shortUrl": "https://www.theguardian.com/p/x38tna",
          "thumbnail": "https://media.guim.co.uk/f742dab48ff82b8d2760119514a87623673395bd/292_0_2619_2095/500.jpg",
          "bodyText": "Jensen Huang, the co-founder and chief executive of the US AI chipmaker Nvidia, has predicted “the UK is going to be an AI superpower” as he announced a new £500m investment in a British firm. Huang, who is due to join Donald Trump at Wednesday night’s state banquet with the king, said he was taking an equity stake in NScale, a UK cloud computing company, and predicted it would earn revenues of up to £50bn over the next six years. “We’re here to announce that the UK is going to be an AI superpower,” he told a press conference in London. Huang cited as evidence of Britain’s potential its universities and several companies founded in the UK, ranging from the AI giant DeepMind to the driverless car startup Wayve. “You just don’t appreciate it. Your universities. Come on. You’re too humble,” he said. The semiconductor boss spoke as China moved to ban its biggest AI firms from buying Nvidia chips, in a sign of the growing geopolitical battle to gain dominance in AI. Huang said he was “disappointed” at reports that Beijing was bringing in the ban, adding: “It is safer for the world that China and the United States collaborate in AI, and Chinese researchers collaborate in AI than to isolate.” He said Nvidia was selling 120,000 graphics processing units to the UK as part of an investment amounting to £11bn, with 70% of that cost coming from computing and networking, including the chips, and 30% going on land, power and the structures of the datacentre. Huang said the combined additional computing power would be “approximately 100 times the performance of the fastest supercomputer in the UK right now, the Isambard AI supercomputer [in Bristol]”. He also stepped into a row over how AI companies treat artists’ copyrighted material, which has been used wholesale to train AI systems, saying: “Artists should have the ability to monetise their creation … we have to find ways for them to continue to do so.” Elton John and Mick Jagger were among a swathe of high-profile artists who this week complained Labour had failed to defend artists’ basic rights by blocking attempts to force artificial intelligence firms to reveal what copyrighted material they have used in their systems. Huang’s upbeat statement about Britain’s AI superpower future was tempered by a warning that “a challenge” remained to secure enough electricity to fuel the necessary wave of power-hungry data factories. He said nuclear power and gas turbine power stations would be needed. He also urged the UK to develop its own AI systems, despite the huge wave of US investment from Microsoft, Google and OpenAI announced this week. “Every country should create its own AI … I think the UK will have to do the same. The data belongs to you. It belongs to your people. It’s created by your people, your companies. And you should be able to … transform that data into your national interest,” he said."
        },
        "isHosted": false,
        "pillarId": "pillar/news",
        "pillarName": "News"
      },
      {
        "id": "technology/2025/sep/16/how-ai-is-undermining-learning-and-teaching-in-universities",
        "type": "article",
        "sectionId": "technology",
        "sectionName": "Technology",
        "webPublicationDate": "2025-09-16T16:22:48Z",
        "webTitle": "How AI is undermining learning and teaching in universities | Letter",
        "webUrl": "https://www.theguardian.com/technology/2025/sep/16/how-ai-is-undermining-learning-and-teaching-in-universities",
        "apiUrl": "https://content.guardianapis.com/technology/2025/sep/16/how-ai-is-undermining-learning-and-teaching-in-universities",
        "fields": {
          "headline": "How AI is undermining learning and teaching in universities",
          "trailText": "Letter:<strong> Prof Leo McCann </strong>and<strong> Prof Simon Sweeney </strong>say<strong> </strong>student misuse of generative artificial intelligence is widespread and we must be sceptical of its usefulness",
          "publication": "The Guardian",
          "shortUrl": "https://www.theguardian.com/p/x3878g",
          "thumbnail": "https://media.guim.co.uk/737c2a42df70b96a37306fc7b253e4ca99f339ad/0_0_3906_3125/500.jpg",
          "bodyText": "In discussing generative artificial intelligence (‘It’s going to be a life skill’: educators discuss the impact of AI on university education, 13 September) you appear to underestimate the challenges that large language model (LLM) tools such as ChatGPT present to higher education. The argument that mastering AI is a life skill that students need in preparation for the labour market is unconvincing. Our experience is that generative AI undermines teaching and learning, bypasses reflection and criticality, and deflects students from reading original material. Student misuse of generative AI is widespread. Claims that AI helps preparation or research is simply cover for students taking shortcuts that do not develop their learning skills. Assessments are widely channelled through ChatGPT, disregarding universities’ usually feeble guidance and rules. Generative AI results in generic, dull and often factually incorrect output. For example, we asked students to interpret a short article by Henry Ford from 1922. Many answers suggested that the autocratic and racist Ford was developing a “sophisticated HR performance management function for his business” and that he was a “transformational leader”. In many degree programmes, LLMs have little to no practical value. Their use sabotages and degrades students’ learning and undermines critical analysis and creativity. If we are to make better sense of the impact of AI on work, education and everyday life, we need to be more sceptical and less celebratory. Prof Leo McCann Prof Simon Sweeney University of York • Have an opinion on anything you’ve read in the Guardian today? Please email us your letter and it will be considered for publication in our letters section."
        },
        "isHosted": false,
        "pillarId": "pillar/news",
        "pillarName": "News"
      },
      {
        "id": "technology/2025/sep/16/top-uk-artists-urge-starmer-to-protect-their-work-on-eve-of-trump-visit",
        "type": "article",
        "sectionId": "technology",
        "sectionName": "Technology",
        "webPublicationDate": "2025-09-16T05:00:28Z",
        "webTitle": "Top UK artists urge Starmer to protect their work on eve of Trump visit",
        "webUrl": "https://www.theguardian.com/technology/2025/sep/16/top-uk-artists-urge-starmer-to-protect-their-work-on-eve-of-trump-visit",
        "apiUrl": "https://content.guardianapis.com/technology/2025/sep/16/top-uk-artists-urge-starmer-to-protect-their-work-on-eve-of-trump-visit",
        "fields": {
          "headline": "Top UK artists urge Starmer to protect their work on eve of Trump visit",
          "trailText": "Paul McCartney, Kate Bush and Elton John among creatives arguing that Labour’s AI proposals could result in ‘an artist’s life work to be stolen’",
          "byline": "Dan Milmo Global technology editor",
          "publication": "The Guardian",
          "shortUrl": "https://www.theguardian.com/p/x387zd",
          "thumbnail": "https://media.guim.co.uk/f004a1627567a2a83ed772a0fe7b3065f3968ac5/328_0_3280_2624/500.jpg",
          "bodyText": "Leading British artists including Mick Jagger, Kate Bush and Paul McCartney have urged Keir Starmer to stand up for creators’ human rights and protect their work ahead of a UK-US tech deal during Donald Trump’s visit. In a letter to the prime minister, they argued Labour had failed to defend artists’ basic rights by blocking attempts to force artificial intelligence firms to reveal what copyrighted material they have used in their systems. Senior figures in US tech are accompanying the US president on his state visit, where an announcement is expected on a UK-US tech pact covering areas including AI. Elton John, one of the letter’s signatories, said government proposals to let AI companies train their systems on copyright-protected work without permission “leaves the door wide open for an artist’s life work to be stolen”. “We will not accept this,” he added. “And we will not let the government forget their election promises to support our creative industries.” Other signatories include Annie Lennox, the writer Antonia Fraser, and the actor and playwright Kwame Kwei Armah. Creative organisations backing the letter include the News Media Association, which represents news publishers including the Guardian’s owner the Guardian Media Group, the Society of London Theatre &amp; UK Theatre, and Mumsnet. There are more than 70 signatories in total. The letter claims that copyright law is being flouted “en masse” by tech companies to build AI models and raises the government’s refusal to accept amendments to the recent data (use and access) bill that would have forced AI firms to reveal what copyrighted material they have used in their systems. Such a move “actively stood in the way” of creators exercising their human rights, the letter adds, referring to the UN’s international covenant on economic, social and cultural rights (ICESCR), the Berne convention for the protection of literary and artistic works and the European convention on human rights – the latter enforceable in the UK through the Human Rights Act. The letter points to a provision in the ECHR stating that “no one shall be deprived of his possessions except in the public interest”, adding that removing the amendments breached UK citizens’ rights, under the ICESCR, to “the protection of the moral and material interests resulting from any scientific, literary or artistic production of which he is author”. “The government’s formal position has exhibited a shocking indifference to mass theft, and a complete unwillingness to enforce the existing law to uphold the human rights stipulated by the ICESCR, the Berne Convention and the ECHR,” said the letter. Labour has been at loggerheads with the UK’s creative community ever since launching a consultation on reforming copyright law, with the preferred option of letting AI companies use copyright-protected work without seeking the owner’s permission – unless they signal a desire to opt out of the process. The government has said this is no longer its preferred option and has convened working groups – drawn from the creative and AI sectors – to come up with solutions to the issue. Beeban Kidron, the crossbench peer who tabled the data bill amendments, said the working groups were “packed” with US interests – members include ChatGPT developer OpenAI and Mark Zuckerberg’s Meta – and pointed to recent government deals with Google and OpenAI as evidence of a continuing close relationship with US tech. Kidron said failure to protect copyright contravened artists’ human rights. “It’s deeply regrettable that it has come to this, but by prioritising the short-term optics of data centre announcements and trade deals, they are knowingly undermining the foundations of the UK’s creative industries,” said Lady Kidron. A UK government spokesperson said the the creative industries’ concerns over copyright were being taken “seriously” and a report into the impact of potential changes would be published by the end of March next year. “No decisions have been taken, but our focus is on both supporting rights holders and creatives, while making sure AI models can be trained on high-quality material in the UK,” said the spokesperson."
        },
        "isHosted": false,
        "pillarId": "pillar/news",
        "pillarName": "News"
      }
    ]
  }
}
